## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.cloud-dns will be read during apply
  # (config refers to values not yet known)
 <= data "google_service_account" "cloud-dns" {
+       account_id   = (known after apply)
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.cloud-dns will be created
+   resource "google_service_account_key" "cloud-dns" {
+       id                 = (known after apply)
+       key_algorithm      = "KEY_ALG_RSA_2048"
+       name               = (known after apply)
+       private_key        = (sensitive value)
+       private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
+       public_key         = (known after apply)
+       public_key_type    = "TYPE_X509_PEM_FILE"
+       service_account_id = (known after apply)
+       valid_after        = (known after apply)
+       valid_before       = (known after apply)
    }

  # helm_release.cluster-issuer will be updated in-place
!   resource "helm_release" "cluster-issuer" {
        id                         = "cluster-issuer"
        name                       = "cluster-issuer"
!       version                    = "0.2.1" -> "0.2.2"
        # (25 unchanged attributes hidden)

-       set_sensitive {
-           name  = "zerossl-eab-hmac-key" -> null
-           value = (sensitive value)
        }
+       set_sensitive {
+           name  = "zerossl-eab-hmac-key"
+           value = (sensitive value)
        }
-       set_sensitive {
-           name  = "zerossl-eab-hmac-key-id" -> null
-           value = (sensitive value)
        }
+       set_sensitive {
+           name  = "zerossl-eab-hmac-key-id"
+           value = (sensitive value)
        }
-       set_sensitive {
-           name  = "zerossl_email" -> null
-           value = (sensitive value)
        }
+       set_sensitive {
+           name  = "zerossl_email"
+           value = (sensitive value)
        }
+       set_sensitive {
+           name  = "zerossl_gcp_cloud_dns_account"
+           value = (sensitive value)
        }
-       set_sensitive {
-           name  = "zerossl_gcp_project_id" -> null
-           value = (sensitive value)
        }
+       set_sensitive {
+           name  = "zerossl_gcp_project_id"
+           value = (sensitive value)
        }
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

  # module.cloud-dns.module.iam.google_service_account_iam_binding.service_account_iam_authoritative["default--roles/iam.workloadIdentityUser"] will be created
+   resource "google_service_account_iam_binding" "service_account_iam_authoritative" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       members            = (known after apply)
+       role               = (known after apply)
+       service_account_id = (known after apply)

+       condition {
+           description = (known after apply)
+           expression  = (known after apply)
+           title       = (known after apply)
        }
    }

  # module.cloud-dns.module.service_account.google_project_iam_member.project-roles["external-dns-wayofthesys-cinema-363715=>roles/dns.admin"] will be created
+   resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "wayofthesys-cinema-363715"
+       role    = "roles/dns.admin"
    }

  # module.cloud-dns.module.service_account.google_service_account.service_accounts["external-dns"] will be created
+   resource "google_service_account" "service_accounts" {
+       account_id   = "external-dns"
+       disabled     = false
+       display_name = "Terraform-managed service account"
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       project      = "wayofthesys-cinema-363715"
+       unique_id    = (known after apply)
    }

Plan: 4 to add, 2 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 248.11 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 248.11 | 248.11|
| | **Total** | **0.00** | **248.11** | **248.11** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
